# ============================================================
# Brewfile - Homebrew Bundle Konfiguration
# ============================================================
# Zweck     : Deklarative Homebrew-Abhängigkeiten
# Verwendung: brew bundle (via HOMEBREW_BUNDLE_FILE in .zprofile)
# Docs      : https://github.com/Homebrew/homebrew-bundle
# ============================================================
# Format für Doku-Generierung:
#   brew/cask: # Beschreibung | https://docs-url
#   mas:       # Beschreibung (URL wird aus ID generiert)
# ============================================================

# ------------------------------------------------------------
# Shell-Grundlagen
# Prompt, Syntax-Highlighting, Auto-Suggestions
# ------------------------------------------------------------
brew "starship"                             # Shell-Prompt | https://starship.rs/
brew "zsh-syntax-highlighting"              # Syntax-Highlighting | https://github.com/zsh-users/zsh-syntax-highlighting
brew "zsh-autosuggestions"                  # History-Vorschläge | https://github.com/zsh-users/zsh-autosuggestions

# ------------------------------------------------------------
# Unix-Moderne
# Verbesserte Standardtools – Basis für fzf, yazi und standalone
# ------------------------------------------------------------
brew "bat"                                  # cat-Ersatz mit Syntax-Highlighting | https://github.com/sharkdp/bat
brew "eza"                                  # ls-Ersatz mit Git-Status und Icons | https://github.com/eza-community/eza
brew "fd"                                   # find-Ersatz, schnell und intuitiv | https://github.com/sharkdp/fd
brew "ripgrep"                              # grep-Ersatz, schnellste Textsuche | https://github.com/BurntSushi/ripgrep

# ------------------------------------------------------------
# Navigation & Suche
# Fuzzy Finding, smartes cd, visueller File Manager
# ------------------------------------------------------------
brew "fzf"                                  # Fuzzy Finder für alles | https://github.com/junegunn/fzf
brew "zoxide"                               # Smartes cd mit Frecency | https://github.com/ajeetdsouza/zoxide
brew "yazi"                                 # Terminal File Manager | https://yazi-rs.github.io/

# ------------------------------------------------------------
# Medien-Codecs
# Previews in yazi + eigenständige Konvertierung
# ------------------------------------------------------------
brew "ffmpeg"                               # Video/Audio-Codec | https://ffmpeg.org/
brew "imagemagick"                          # Bild-Manipulation | https://imagemagick.org/
brew "poppler"                              # PDF-Rendering | https://poppler.freedesktop.org/
brew "resvg"                                # SVG-Rendering | https://github.com/RazrFalcon/resvg
brew "sevenzip"                             # Archiv-Extraktion | https://7-zip.org/

# ------------------------------------------------------------
# Monitoring & Git
# System-Status und Versionskontrolle
# ------------------------------------------------------------
brew "btop"                                 # Ressourcen-Monitor | https://github.com/aristocratos/btop
brew "fastfetch"                            # System-Info | https://github.com/fastfetch-cli/fastfetch
brew "lazygit"                              # Git-TUI | https://github.com/jesseduffield/lazygit
brew "gh"                                   # GitHub CLI | https://cli.github.com/

# ------------------------------------------------------------
# dotfiles-Meta
# Tools für dieses Repository
# ------------------------------------------------------------
brew "stow"                                 # Symlink-Manager | https://www.gnu.org/software/stow/
brew "tealdeer"                             # tldr-Client | https://tealdeer-rs.github.io/tealdeer/
brew "markdownlint-cli2"                    # Markdown-Linter | https://github.com/DavidAnson/markdownlint-cli2

# ------------------------------------------------------------
# KI-Assistenten
# ------------------------------------------------------------
cask "claude-code"                          # Agentic Coding | https://docs.anthropic.com/en/docs/claude-code

# ------------------------------------------------------------
# Fonts
# ------------------------------------------------------------
cask "font-meslo-lg-nerd-font"              # Nerd Font für Prompt, eza, yazi | https://github.com/ryanoasis/nerd-fonts

# ------------------------------------------------------------
# Mac App Store
# ------------------------------------------------------------
brew "mas"                                  # Mac App Store CLI | https://github.com/mas-cli/mas
mas "Xcode", id: 497799835                  # Apple IDE
mas "Pages", id: 409201541                  # Textverarbeitung
mas "Numbers", id: 409203825                # Tabellenkalkulation
mas "Keynote", id: 409183694                # Präsentationen
