# ============================================================
# Brewfile - Homebrew Bundle Konfiguration
# ============================================================
# Zweck       : Deklarative Homebrew-Abhängigkeiten
# Verwendung  : brew bundle (via HOMEBREW_BUNDLE_FILE in .zprofile)
# Docs        : https://github.com/Homebrew/homebrew-bundle
# Generiert   : docs/setup.md (Tool-Tabellen)
# ============================================================
# Format für Doku-Generierung:
#   brew/cask: # Beschreibung | https://docs-url
#   mas:       # Beschreibung (URL wird aus ID generiert)
# ============================================================

# ------------------------------------------------------------
# Homebrew Formulae
# ------------------------------------------------------------
brew "bat"                                  # cat-Ersatz mit Syntax-Highlighting | https://github.com/sharkdp/bat
brew "btop"                                 # Ressourcen-Monitor | https://github.com/aristocratos/btop
brew "eza"                                  # ls-Ersatz mit Git-Status und Icons | https://github.com/eza-community/eza
brew "fastfetch"                            # System-Info | https://github.com/fastfetch-cli/fastfetch
brew "fd"                                   # find-Ersatz, schnell und intuitiv | https://github.com/sharkdp/fd
brew "ffmpeg"                               # Video/Audio-Codec | https://ffmpeg.org/
brew "fzf"                                  # Fuzzy Finder | https://github.com/junegunn/fzf
brew "gh"                                   # GitHub CLI | https://cli.github.com/
brew "imagemagick"                          # Bild-Manipulation | https://imagemagick.org/
brew "lazygit"                              # Git-TUI | https://github.com/jesseduffield/lazygit
brew "markdownlint-cli2"                    # Markdown-Linter | https://github.com/DavidAnson/markdownlint-cli2
brew "poppler"                              # PDF-Rendering | https://poppler.freedesktop.org/
brew "resvg"                                # SVG-Rendering | https://github.com/RazrFalcon/resvg
brew "ripgrep"                              # grep-Ersatz, schnellste Textsuche | https://github.com/BurntSushi/ripgrep
brew "sevenzip"                             # Archiv-Extraktion | https://7-zip.org/
brew "shellcheck"                           # Shell-Script-Linter (für Bash) | https://www.shellcheck.net/
brew "starship"                             # Shell-Prompt | https://starship.rs/
brew "stow"                                 # Symlink-Manager | https://www.gnu.org/software/stow/
brew "tealdeer"                             # tldr-Client | https://tealdeer-rs.github.io/tealdeer/
brew "yazi"                                 # File Manager | https://yazi-rs.github.io/
brew "zoxide"                               # Smartes cd mit Frecency | https://github.com/ajeetdsouza/zoxide
brew "zsh-autosuggestions"                  # History-Vorschläge | https://github.com/zsh-users/zsh-autosuggestions
brew "zsh-syntax-highlighting"              # Syntax-Highlighting | https://github.com/zsh-users/zsh-syntax-highlighting
brew "mas"                                  # Mac App Store CLI | https://github.com/mas-cli/mas

# ------------------------------------------------------------
# Homebrew Casks
# ------------------------------------------------------------
cask "claude-code"                          # Agentic Coding | https://docs.anthropic.com/en/docs/claude-code
cask "github"                               # GitHub Desktop GUI | https://desktop.github.com/
cask "kitty"                                # GPU-Terminal mit Image-Support | https://sw.kovidgoyal.net/kitty/
cask "visual-studio-code"                   # Editor | https://code.visualstudio.com/
cask "font-jetbrains-mono-nerd-font"        # Nerd Font | https://github.com/ryanoasis/nerd-fonts
cask "font-meslo-lg-nerd-font"              # Nerd Font | https://github.com/ryanoasis/nerd-fonts

# ------------------------------------------------------------
# Mac App Store
# ------------------------------------------------------------
mas "Keynote", id: 409183694                # Präsentationen
mas "Numbers", id: 409203825                # Tabellenkalkulation
mas "Pages", id: 409201541                  # Textverarbeitung
mas "Pixelmator Pro", id: 1289583905        # Bildbearbeitung
mas "Xcode", id: 497799835                  # Apple IDE
