# ============================================================
# Brewfile - Homebrew Bundle Konfiguration
# ============================================================
# Zweck     : Deklarative Homebrew-Abhängigkeiten
# Verwendung: brew bundle (via HOMEBREW_BUNDLE_FILE in .zprofile)
# Docs      : https://github.com/Homebrew/homebrew-bundle
# ============================================================
# Format für Doku-Generierung:
#   brew/cask: # Beschreibung | https://docs-url
#   mas:       # Beschreibung (URL wird aus ID generiert)
# ============================================================

# ------------------------------------------------------------
# Shell & Prompt
# ------------------------------------------------------------
brew "fzf"                                  # Fuzzy Finder | https://github.com/junegunn/fzf
brew "starship"                             # Shell-Prompt | https://starship.rs/
brew "zoxide"                               # Smartes cd | https://github.com/ajeetdsouza/zoxide
brew "zsh-syntax-highlighting"              # Syntax-Highlighting | https://github.com/zsh-users/zsh-syntax-highlighting
brew "zsh-autosuggestions"                  # History-Vorschläge | https://github.com/zsh-users/zsh-autosuggestions

# ------------------------------------------------------------
# CLI-Ersetzungen (modern → klassisch)
# ------------------------------------------------------------
brew "bat"                                  # cat → bat | https://github.com/sharkdp/bat
brew "eza"                                  # ls → eza | https://github.com/eza-community/eza
brew "fd"                                   # find → fd | https://github.com/sharkdp/fd
brew "ripgrep"                              # grep → rg | https://github.com/BurntSushi/ripgrep

# ------------------------------------------------------------
# Terminal-Apps (TUI)
# ------------------------------------------------------------
brew "btop"                                 # Ressourcen-Monitor | https://github.com/aristocratos/btop
brew "fastfetch"                            # System-Info | https://github.com/fastfetch-cli/fastfetch
brew "lazygit"                              # Git-UI | https://github.com/jesseduffield/lazygit
brew "yazi"                                 # File Manager | https://yazi-rs.github.io/

# ------------------------------------------------------------
# Medien-Tools (yazi-Previews + Konvertierung)
# ------------------------------------------------------------
brew "ffmpeg"                               # Video/Audio | https://ffmpeg.org/
brew "imagemagick"                          # Bilder | https://imagemagick.org/
brew "poppler"                              # PDF | https://poppler.freedesktop.org/
brew "resvg"                                # SVG | https://github.com/RazrFalcon/resvg
brew "sevenzip"                             # Archive | https://7-zip.org/

# ------------------------------------------------------------
# Entwickler-Tools
# ------------------------------------------------------------
brew "gh"                                   # GitHub CLI | https://cli.github.com/
brew "markdownlint-cli2"                    # Markdown-Linter | https://github.com/DavidAnson/markdownlint-cli2
brew "stow"                                 # Symlink-Manager | https://www.gnu.org/software/stow/
brew "tealdeer"                             # tldr-Client | https://tealdeer-rs.github.io/tealdeer/

# ------------------------------------------------------------
# Fonts
# ------------------------------------------------------------
cask "font-meslo-lg-nerd-font"              # Nerd Font für Terminal | https://github.com/ryanoasis/nerd-fonts

# ------------------------------------------------------------
# macOS Apps
# ------------------------------------------------------------
cask "claude-code"                          # KI-Coding-Assistent | https://www.anthropic.com/claude-code
brew "mas"                                  # Mac App Store CLI | https://github.com/mas-cli/mas
mas "Xcode", id: 497799835                  # Apple IDE
mas "Pages", id: 409201541                  # Textverarbeitung
mas "Numbers", id: 409203825                # Tabellenkalkulation
mas "Keynote", id: 409183694                # Präsentationen
